{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 260, 260, 3], "name": "data", "sparse": false}, "inbound_nodes": [], "name": "data"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["data", 0, 0, {}]]], "name": "conv2d_0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_0_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_0", 0, 0, {}]]], "name": "conv2d_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_0_activation"}, "inbound_nodes": [[["conv2d_0_bn", 0, 0, {}]]], "name": "conv2d_0_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_0", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_0_activation", 0, 0, {}]]], "name": "maxpool2d_0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_0", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_1_activation"}, "inbound_nodes": [[["conv2d_1_bn", 0, 0, {}]]], "name": "conv2d_1_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_1_activation", 0, 0, {}]]], "name": "maxpool2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_2_activation"}, "inbound_nodes": [[["conv2d_2_bn", 0, 0, {}]]], "name": "conv2d_2_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_2_activation", 0, 0, {}]]], "name": "maxpool2d_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_3_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_3_activation"}, "inbound_nodes": [[["conv2d_3_bn", 0, 0, {}]]], "name": "conv2d_3_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]], "name": "maxpool2d_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "conv2d_4_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_4_activation"}, "inbound_nodes": [[["conv2d_4_bn", 0, 0, {}]]], "name": "conv2d_4_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]], "name": "maxpool2d_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_5_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_5_activation"}, "inbound_nodes": [[["conv2d_5_bn", 0, 0, {}]]], "name": "conv2d_5_activation"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]], "name": "maxpool2d_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "conv2d_6_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_6_activation"}, "inbound_nodes": [[["conv2d_6_bn", 0, 0, {}]]], "name": "conv2d_6_activation"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_7_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2d_7_activation"}, "inbound_nodes": [[["conv2d_7_bn", 0, 0, {}]]], "name": "conv2d_7_activation"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "cls_0_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]], "name": "cls_0_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "cls_1_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]], "name": "cls_1_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "cls_2_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]], "name": "cls_2_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "cls_3_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]], "name": "cls_3_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "cls_4_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_7_activation", 0, 0, {}]]], "name": "cls_4_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "loc_0_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]], "name": "loc_0_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "loc_1_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]], "name": "loc_1_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "loc_2_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]], "name": "loc_2_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "loc_3_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]], "name": "loc_3_insert_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "loc_4_insert_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_7_activation", 0, 0, {}]]], "name": "loc_4_insert_conv2d"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "cls_0_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["cls_0_insert_conv2d", 0, 0, {}]]], "name": "cls_0_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "cls_1_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["cls_1_insert_conv2d", 0, 0, {}]]], "name": "cls_1_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "cls_2_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["cls_2_insert_conv2d", 0, 0, {}]]], "name": "cls_2_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "cls_3_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["cls_3_insert_conv2d", 0, 0, {}]]], "name": "cls_3_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "cls_4_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["cls_4_insert_conv2d", 0, 0, {}]]], "name": "cls_4_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "loc_0_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["loc_0_insert_conv2d", 0, 0, {}]]], "name": "loc_0_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "loc_1_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["loc_1_insert_conv2d", 0, 0, {}]]], "name": "loc_1_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "loc_2_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["loc_2_insert_conv2d", 0, 0, {}]]], "name": "loc_2_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "loc_3_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["loc_3_insert_conv2d", 0, 0, {}]]], "name": "loc_3_insert_conv2d_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "loc_4_insert_conv2d_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["loc_4_insert_conv2d", 0, 0, {}]]], "name": "loc_4_insert_conv2d_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "cls_0_insert_conv2d_activation"}, "inbound_nodes": [[["cls_0_insert_conv2d_bn", 0, 0, {}]]], "name": "cls_0_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "cls_1_insert_conv2d_activation"}, "inbound_nodes": [[["cls_1_insert_conv2d_bn", 0, 0, {}]]], "name": "cls_1_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "cls_2_insert_conv2d_activation"}, "inbound_nodes": [[["cls_2_insert_conv2d_bn", 0, 0, {}]]], "name": "cls_2_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "cls_3_insert_conv2d_activation"}, "inbound_nodes": [[["cls_3_insert_conv2d_bn", 0, 0, {}]]], "name": "cls_3_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "cls_4_insert_conv2d_activation"}, "inbound_nodes": [[["cls_4_insert_conv2d_bn", 0, 0, {}]]], "name": "cls_4_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "loc_0_insert_conv2d_activation"}, "inbound_nodes": [[["loc_0_insert_conv2d_bn", 0, 0, {}]]], "name": "loc_0_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "loc_1_insert_conv2d_activation"}, "inbound_nodes": [[["loc_1_insert_conv2d_bn", 0, 0, {}]]], "name": "loc_1_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "loc_2_insert_conv2d_activation"}, "inbound_nodes": [[["loc_2_insert_conv2d_bn", 0, 0, {}]]], "name": "loc_2_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "loc_3_insert_conv2d_activation"}, "inbound_nodes": [[["loc_3_insert_conv2d_bn", 0, 0, {}]]], "name": "loc_3_insert_conv2d_activation"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "loc_4_insert_conv2d_activation"}, "inbound_nodes": [[["loc_4_insert_conv2d_bn", 0, 0, {}]]], "name": "loc_4_insert_conv2d_activation"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cls_0_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cls_0_insert_conv2d_activation", 0, 0, {}]]], "name": "cls_0_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cls_1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cls_1_insert_conv2d_activation", 0, 0, {}]]], "name": "cls_1_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cls_2_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cls_2_insert_conv2d_activation", 0, 0, {}]]], "name": "cls_2_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cls_3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cls_3_insert_conv2d_activation", 0, 0, {}]]], "name": "cls_3_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cls_4_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cls_4_insert_conv2d_activation", 0, 0, {}]]], "name": "cls_4_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "loc_0_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["loc_0_insert_conv2d_activation", 0, 0, {}]]], "name": "loc_0_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "loc_1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["loc_1_insert_conv2d_activation", 0, 0, {}]]], "name": "loc_1_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "loc_2_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["loc_2_insert_conv2d_activation", 0, 0, {}]]], "name": "loc_2_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "loc_3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["loc_3_insert_conv2d_activation", 0, 0, {}]]], "name": "loc_3_conv"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "loc_4_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["loc_4_insert_conv2d_activation", 0, 0, {}]]], "name": "loc_4_conv"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 2], "trainable": true, "name": "cls_0_reshape"}, "inbound_nodes": [[["cls_0_conv", 0, 0, {}]]], "name": "cls_0_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 2], "trainable": true, "name": "cls_1_reshape"}, "inbound_nodes": [[["cls_1_conv", 0, 0, {}]]], "name": "cls_1_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 2], "trainable": true, "name": "cls_2_reshape"}, "inbound_nodes": [[["cls_2_conv", 0, 0, {}]]], "name": "cls_2_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 2], "trainable": true, "name": "cls_3_reshape"}, "inbound_nodes": [[["cls_3_conv", 0, 0, {}]]], "name": "cls_3_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 2], "trainable": true, "name": "cls_4_reshape"}, "inbound_nodes": [[["cls_4_conv", 0, 0, {}]]], "name": "cls_4_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 4], "trainable": true, "name": "loc_0_reshape"}, "inbound_nodes": [[["loc_0_conv", 0, 0, {}]]], "name": "loc_0_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 4], "trainable": true, "name": "loc_1_reshape"}, "inbound_nodes": [[["loc_1_conv", 0, 0, {}]]], "name": "loc_1_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 4], "trainable": true, "name": "loc_2_reshape"}, "inbound_nodes": [[["loc_2_conv", 0, 0, {}]]], "name": "loc_2_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 4], "trainable": true, "name": "loc_3_reshape"}, "inbound_nodes": [[["loc_3_conv", 0, 0, {}]]], "name": "loc_3_reshape"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 4], "trainable": true, "name": "loc_4_reshape"}, "inbound_nodes": [[["loc_4_conv", 0, 0, {}]]], "name": "loc_4_reshape"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "cls_0_activation"}, "inbound_nodes": [[["cls_0_reshape", 0, 0, {}]]], "name": "cls_0_activation"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "cls_1_activation"}, "inbound_nodes": [[["cls_1_reshape", 0, 0, {}]]], "name": "cls_1_activation"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "cls_2_activation"}, "inbound_nodes": [[["cls_2_reshape", 0, 0, {}]]], "name": "cls_2_activation"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "cls_3_activation"}, "inbound_nodes": [[["cls_3_reshape", 0, 0, {}]]], "name": "cls_3_activation"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "cls_4_activation"}, "inbound_nodes": [[["cls_4_reshape", 0, 0, {}]]], "name": "cls_4_activation"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "loc_branch_concat", "axis": 1}, "inbound_nodes": [[["loc_0_reshape", 0, 0, {}], ["loc_1_reshape", 0, 0, {}], ["loc_2_reshape", 0, 0, {}], ["loc_3_reshape", 0, 0, {}], ["loc_4_reshape", 0, 0, {}]]], "name": "loc_branch_concat"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "cls_branch_concat", "axis": 1}, "inbound_nodes": [[["cls_0_activation", 0, 0, {}], ["cls_1_activation", 0, 0, {}], ["cls_2_activation", 0, 0, {}], ["cls_3_activation", 0, 0, {}], ["cls_4_activation", 0, 0, {}]]], "name": "cls_branch_concat"}], "input_layers": [["data", 0, 0]], "output_layers": [["loc_branch_concat", 0, 0], ["cls_branch_concat", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}